Revit 2027 API
ScheduleField.IsValidCombinedParameters Method
 Checks if data is valid for combined parameters
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData> data
)
Public Function IsValidCombinedParameters (
	data As IList(Of TableCellCombinedParameterData)
) As Boolean
public:
bool IsValidCombinedParameters(
	IList<TableCellCombinedParameterData^>^ data
)
member IsValidCombinedParameters :
        data : IList<TableCellCombinedParameterData> -> bool
Parameters
data IList<TableCellCombinedParameterData>
 data is array of TableCellCombinedParameterData to be set as combined parameters
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ScheduleField Class
Autodesk.Revit.DB Namespace